src/test/resources/soapRequests/TestAPI1.xml

<?xml version="1.0" encoding="UTF-8"?><soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap12:Body>
    <Subtract xmlns="http://tempuri.org/">
      <intA>9</intA>
      <intB>4</intB>
    </Subtract>
  </soap12:Body>
</soap12:Envelope>