7App1/1.txt

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <Subtract
            xmlns="http://tempuri.org/">
            <intA>
                12
                </intA>
            <intB>
                5
                </intB>
            </Subtract>
        </s:Body>
    </s:Envelope>

<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <SubtractResponse
            xmlns="http://tempuri.org/">
            <SubtractResult>
                7
                </SubtractResult>
            </SubtractResponse>
        </soap:Body>
    </soap:Envelope>
