TestData/Subtract.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Subtract>
         <tem:intA>18</tem:intA>
         <tem:intB>8</tem:intB>
      </tem:Subtract>
   </soapenv:Body>
</soapenv:Envelope>