scripts/test/addRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:tem="http://tempuri.org/" >
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:intA>275</tem:intA>
         <tem:intB>500</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>
