src/test/java/com/vianvi/feature/test/data/soapCalRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:Add>
            <tem:intA>20</tem:intA>
            <tem:intB>30</tem:intB>
        </tem:Add>
    </soapenv:Body>
</soapenv:Envelope>
